#    -*- mode: org -*-


Archived entries from file /Users/Nelsonian/Projects/ii/apisnoop_webui/web_ui.org


*** Testing everything
    :PROPERTIES:
    :header-args: :dir ~/Projects/ii/apisnoop_webui/backend :results output verbatim drawer
    :END:

    With yr tests configured you can run them all in the terminal.
    #+NAME: test everything
    #+BEGIN_SRC shell
      yarn test
    #+END_SRC

    #+RESULTS: test everything
    :RESULTS:
    :END:

**** Create new service with feathers
     this will take some prompts, so this isn't meant to be executed.
     #+NAME: create new service with feathers
     #+BEGIN_SRC
     feathers generate service
     #+END_SRC
     we chose a custom service called config, at the path /config.  It's data won't be stored by us, but instead come from github.
     Generating this custom service will give us a class file, hooks file, and service file within our services, like so:
     #+NAME: Feathers Services
     #+BEGIN_SRC shell :dir ./backend/src/services/config :results output verbatim drawer
      tree
     #+END_SRC
     #+RESULTS: Feathers Services
     :RESULTS:
     .
     ├── config.class.js
     ├── config.hooks.js
     └── config.service.js

     0 directories, 3 files
     :END:
**** Install some extra modules.
     we want to install [[https://npmjs.com/js-yaml][js-yaml]], for converting yaml into json.
     #+NAME: Install JS-Yaml
     #+BEGIN_SRC :dir ./backend/
    npm install js-yaml
     #+END_SRC

     and we want request-promise for making requests to github's api.
     #+NAME: Install Request-Promise
     #+BEGIN_SRC shell :dir ./backend/ :results output list
    npm install request-promise
     #+END_SRC

     #+RESULTS: Install Request-Promise
     : - + request-promise@4.2.2
     : - updated 1 package and audited 2967 packages in 5.823s
     : - found 0 vulnerabilities

     #+RESULTS:
     : - + axios@0.18.0
     : - updated 1 package and audited 2967 packages in 4.315s
     : - found 0 vulnerabilities
**** Find github's api url for the yaml.
     The yaml file is stored as a blob.  We can access this blob here: [[https://raw.githubusercontent.com/kubernetes/test-infra/aa6b726dfd7cae670bb4ceeb7bd43f1cd91c4a72/testgrid/config.yaml][config.yaml at kubernetes/test-infra]]
     To grab the contents, though, it's best to do it through the api.  This requires that we know the blob's sha file ([[https://developer.github.com/v3/git/blobs/][github developer guide on blobs]])
     We can do this through a curl request:
     #+NAME: get blob info through curl
     #+BEGIN_SRC shell :results output verbatim
     curl https://api.github.com/repos/kubernetes/test-infra/contents/testgrid/config.yaml | grep 'sha'
     #+END_SRC

     #+RESULTS: get blob info through curl
     :   "sha": "66c3f57e899a92afc9f6fca20387220a65312915",

     So then, the full path to this file, through git's api, would be:
     https://api.github.com/repos/kubernetes/test-infra/git/blobs/66c3f57e899a92afc9f6fca20387220a65312915
